[#146] Standardised API docs (#147)
